load/loadTestResults/be-load-req_duration-failed-on-ci-result.log
## Request duration threshold failed on ci run results:
vamsidarbhamulla@Vamsis-MacBook-Pro tests % docker run -e TEST_TYPE=be --rm --name load-tests-1 load-tests:v1
/home/k6

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: backend/loadTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 1000 max VUs, 55s max duration (incl. graceful stop):
           * default: Up to 1000 looping VUs for 25s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (00.7s), 0071/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 0071/1000 VUs  00.7s/25.0s

running (01.7s), 0171/1000 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 0171/1000 VUs  01.7s/25.0s

running (02.7s), 0271/1000 VUs, 0 complete and 0 interrupted iterations
default   [  11% ] 0271/1000 VUs  02.7s/25.0s

running (03.7s), 0371/1000 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 0371/1000 VUs  03.7s/25.0s

running (04.7s), 0471/1000 VUs, 0 complete and 0 interrupted iterations
default   [  19% ] 0471/1000 VUs  04.7s/25.0s

running (05.7s), 0571/1000 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 0571/1000 VUs  05.7s/25.0s

running (06.7s), 0671/1000 VUs, 0 complete and 0 interrupted iterations
default   [  27% ] 0671/1000 VUs  06.7s/25.0s

running (07.7s), 0771/1000 VUs, 0 complete and 0 interrupted iterations
default   [  31% ] 0771/1000 VUs  07.7s/25.0s

running (08.7s), 0871/1000 VUs, 0 complete and 0 interrupted iterations
default   [  35% ] 0871/1000 VUs  08.7s/25.0s

running (09.7s), 0970/1000 VUs, 0 complete and 0 interrupted iterations
default   [  39% ] 0970/1000 VUs  09.7s/25.0s

running (10.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  43% ] 1000/1000 VUs  10.7s/25.0s

running (11.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  47% ] 1000/1000 VUs  11.7s/25.0s

running (12.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  51% ] 1000/1000 VUs  12.7s/25.0s

running (13.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  55% ] 1000/1000 VUs  13.7s/25.0s

running (14.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  59% ] 1000/1000 VUs  14.7s/25.0s

running (15.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  63% ] 1000/1000 VUs  15.7s/25.0s

running (16.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  67% ] 1000/1000 VUs  16.7s/25.0s

running (17.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  71% ] 1000/1000 VUs  17.7s/25.0s

running (18.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  75% ] 1000/1000 VUs  18.7s/25.0s

running (19.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  79% ] 1000/1000 VUs  19.7s/25.0s

running (20.7s), 1000/1000 VUs, 1 complete and 0 interrupted iterations
default   [  83% ] 1000/1000 VUs  20.7s/25.0s

running (21.7s), 1000/1000 VUs, 1 complete and 0 interrupted iterations
default   [  87% ] 1000/1000 VUs  21.7s/25.0s

running (22.7s), 1000/1000 VUs, 1 complete and 0 interrupted iterations
default   [  91% ] 1000/1000 VUs  22.7s/25.0s

running (23.7s), 1000/1000 VUs, 1 complete and 0 interrupted iterations
default   [  95% ] 1000/1000 VUs  23.7s/25.0s

running (24.7s), 1000/1000 VUs, 2 complete and 0 interrupted iterations
default   [  99% ] 1000/1000 VUs  24.7s/25.0s

running (25.7s), 1000/1000 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (26.7s), 0998/1000 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (27.7s), 0998/1000 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (28.7s), 0997/1000 VUs, 5 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (29.7s), 0995/1000 VUs, 7 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (30.7s), 0995/1000 VUs, 7 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (31.7s), 0994/1000 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (32.7s), 0993/1000 VUs, 9 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (33.7s), 0992/1000 VUs, 10 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (34.7s), 0989/1000 VUs, 13 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (35.7s), 0986/1000 VUs, 16 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (36.7s), 0985/1000 VUs, 17 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (37.7s), 0982/1000 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (38.7s), 0977/1000 VUs, 25 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (39.7s), 0948/1000 VUs, 54 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (40.7s), 0931/1000 VUs, 71 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (41.7s), 0917/1000 VUs, 85 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (42.7s), 0905/1000 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (43.6s), 0894/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (44.6s), 0877/1000 VUs, 125 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (45.6s), 0796/1000 VUs, 139 complete and 67 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (46.6s), 0694/1000 VUs, 142 complete and 166 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (47.6s), 0591/1000 VUs, 148 complete and 263 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (48.6s), 0446/1000 VUs, 198 complete and 358 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (49.6s), 0306/1000 VUs, 250 complete and 446 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (50.6s), 0217/1000 VUs, 259 complete and 526 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (51.6s), 0145/1000 VUs, 270 complete and 587 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (52.6s), 0082/1000 VUs, 293 complete and 627 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (53.6s), 0008/1000 VUs, 343 complete and 651 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (54.6s), 0001/1000 VUs, 347 complete and 654 interrupted iterations
default ↓ [ 100% ] 1000/1000 VUs  25s

running (54.6s), 0000/1000 VUs, 347 complete and 655 interrupted iterations
default ✓ [ 100% ] 0000/1000 VUs  25s

     █ page_1 - https://blazedemo.com/

     █ page_2 - https://blazedemo.com/reserve.php

     █ page_3 - https://blazedemo.com/purchase.php

     data_received..................: 497 MB 9.1 MB/s
     data_sent......................: 4.3 MB 78 kB/s
     group_duration.................: avg=17.05s   min=454.03ms med=15.29s   max=44.46s p(90)=29.94s   p(95)=34.02s
     http_req_blocked...............: avg=28.17ms  min=22.4µs   med=38.69µs  max=3.54s  p(90)=115.45µs p(95)=78.92ms
     http_req_connecting............: avg=10.91ms  min=0s       med=0s       max=1.25s  p(90)=0s       p(95)=30.19ms
   ✗ http_req_duration..............: avg=2.8s     min=43.6ms   med=1.64s    max=36.27s p(90)=6.72s    p(95)=9.9s
       { expected_response:true }...: avg=2.8s     min=43.6ms   med=1.64s    max=36.27s p(90)=6.72s    p(95)=9.9s
   ✓ http_req_failed................: 0.00%  ✓ 0          ✗ 14246
     http_req_receiving.............: avg=1.74s    min=45.4µs   med=182.59ms max=33.46s p(90)=5.41s    p(95)=8.53s
     http_req_sending...............: avg=197.62µs min=54µs     med=155.85µs max=5.98ms p(90)=340.4µs  p(95)=430.9µs
     http_req_tls_handshaking.......: avg=17.18ms  min=0s       med=0s       max=3.41s  p(90)=0s       p(95)=46.2ms
     http_req_waiting...............: avg=1.06s    min=43.02ms  med=669.19ms max=22.96s p(90)=2.61s    p(95)=3.2s
     http_reqs......................: 14246  260.692444/s
     iteration_duration.............: avg=43.94s   min=19.67s   med=44.56s   max=53.33s p(90)=52.34s   p(95)=52.82s
     iterations.....................: 347    6.349872/s
     vus............................: 1      min=1        max=1000
     vus_max........................: 1000   min=1000     max=1000

time="2022-03-13T18:59:14Z" level=error msg="some thresholds have failed"