load/loadTestResults/be-load-test-results.log
          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: loadTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 1000 max VUs, 55s max duration (incl. graceful stop):
           * default: Up to 1000 looping VUs for 25s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (46.4s), 0000/1000 VUs, 1016 complete and 0 interrupted iterations
default ✓ [======================================] 0000/1000 VUs  25s

     █ page_1 - https://blazedemo.com/

     █ page_2 - https://blazedemo.com/reserve.php

     █ page_3 - https://blazedemo.com/purchase.php

     data_received..................: 627 MB 14 MB/s
     data_sent......................: 5.4 MB 117 kB/s
     group_duration.................: avg=9.62s    min=380.8ms med=8.25s    max=38.45s   p(90)=18.96s p(95)=23.28s
     http_req_blocked...............: avg=4.52ms   min=0s      med=1µs      max=248.33ms p(90)=1µs    p(95)=63.9ms
     http_req_connecting............: avg=1.84ms   min=0s      med=0s       max=158.11ms p(90)=0s     p(95)=23.5ms
     http_req_duration..............: avg=1.59s    min=39.51ms med=868ms    max=27.57s   p(90)=3.99s  p(95)=5.56s
       { expected_response:true }...: avg=1.59s    min=39.51ms med=868ms    max=27.57s   p(90)=3.99s  p(95)=5.56s
     http_req_failed................: 0.01%  ✓ 2          ✗ 18286
     http_req_receiving.............: avg=839.8ms  min=26µs    med=36.8ms   max=26.61s   p(90)=2.52s  p(95)=4.26s
     http_req_sending...............: avg=68.79µs  min=18µs    med=49µs     max=5.02ms   p(90)=126µs  p(95)=187µs
     http_req_tls_handshaking.......: avg=2.66ms   min=0s      med=0s       max=194.58ms p(90)=0s     p(95)=38.24ms
     http_req_waiting...............: avg=759.66ms min=38.57ms med=316.19ms max=18.79s   p(90)=2.04s  p(95)=3.17s
     http_reqs......................: 18288  394.318238/s
     iteration_duration.............: avg=29.87s   min=13.08s  med=30.06s   max=44.97s   p(90)=36.91s p(95)=37.68s
     iterations.....................: 1016   21.906569/s
     vus............................: 3      min=3        max=1000
     vus_max........................: 1000   min=1000     max=1000